
## Plan Result




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.artifact_registry[&#34;internal&#34;].google_artifact_registry_repository.artifact_registry
  * module.artifact_registry[&#34;internal&#34;].google_artifact_registry_repository_iam_member.member_service_account
  * module.artifact_registry[&#34;ocim&#34;].google_artifact_registry_repository.artifact_registry
  * module.artifact_registry[&#34;ocim&#34;].google_artifact_registry_repository_iam_member.member_service_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.artifact_registry["internal"].google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + create_time   = (known after apply)
      + description   = "modules-internal repository"
      + format        = "DOCKER"
      + id            = (known after apply)
      + labels        = {
          + "module" = "cap-operator"
          + "name"   = "modules-internal"
          + "owner"  = "neighbors"
          + "type"   = "development"
        }
      + location      = "europe"
      + mode          = "STANDARD_REPOSITORY"
      + name          = (known after apply)
      + project       = (known after apply)
      + repository_id = "modules-internal"
      + update_time   = (known after apply)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.artifact_registry["internal"].google_artifact_registry_repository_iam_member.member_service_account will be created
  + resource "google_artifact_registry_repository_iam_member" "member_service_account" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:sa-kyma-project@sap-kyma-prow.iam.gserviceaccount.com"
      + project    = "sap-kyma-prow"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # module.artifact_registry["ocim"].google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + create_time   = (known after apply)
      + description   = "modules-ocim repository"
      + format        = "DOCKER"
      + id            = (known after apply)
      + labels        = {
          + "module" = "cap-operator"
          + "name"   = "modules-ocim"
          + "owner"  = "neighbors"
          + "type"   = "development"
        }
      + location      = "europe"
      + mode          = "STANDARD_REPOSITORY"
      + name          = (known after apply)
      + project       = (known after apply)
      + repository_id = "modules-ocim"
      + update_time   = (known after apply)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.artifact_registry["ocim"].google_artifact_registry_repository_iam_member.member_service_account will be created
  + resource "google_artifact_registry_repository_iam_member" "member_service_account" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:sa-kyma-project@sap-kyma-prow.iam.gserviceaccount.com"
      + project    = "sap-kyma-prow"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 42, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  42: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```



<!-- github-comment: {"Command":"plan","PRNumber":7977,"Program":"tfcmt","SHA1":"1ab00843e89990c18c57f0baa8c817b9de2b8248","Vars":{}} -->